feat: Ajustes da documentacao
